{
  "id": "034aac3818624a489c49692c16795532",
  "title": "FPS Mechanics - Sliding, Telekinesis, Bullet Time",
  "description": "FPS Sliding, Telekinesis, Bullet Time, Running, Crouching",
  "longDescription": "<p><a href=\"https://www.youtube.com/watch?v&#61;R_3KURBjPOU\" rel=\"nofollow\">TRAILER</a></p><p>This pack comes as a full project and contains the setup and programming (everything is done in blueprints) for the following game mechanics: Sliding, Telekinesis, Bullet Time. As a bonus, you also get smooth crouch for the player (with timeline animation) and setup for running. Sliding is angle sensitive, so the sliding is different depending of the terrain angle. (If the player starts sliding from the top of a hill, it will slide down to the bottom of the hill but if the player will start sliding from the bottom of the hill to the top, sliding will be very short, as it is natural)</p><p>The Telekinesis mechanics allows the player to pickup and move objects around the map. The existing setup also allows player to throw objects away. The Telekinesis distance is a variable which can be modified depending on your needs or game characteristics. You will also be able to create as many pick able objects as you want by creating children of the main blueprint (as shown in the video). In all children, you will be able to change the static mesh, materials, physics properties so everything is very customizable from this point of view. As soon as you enter Telekinesis mode , all the pick able objects will be outlined so the player will always know which are the objects that can be or can not be manipulated by this ability.</p><p>The Bullet Time mechanics works like this: Time passes at normal speed when the player moves and time will slow down a lot when the player doesn&#39;t move. The slow down factor is a variable that can be tweaked according to your needs. All those mechanics can work separately or together to get complex behaviors.</p><p>Input:</p><ol><li>Press E while walking/running, to perform Sliding</li><li>Press Middle Mouse Button to toggle On/Off Telekinesis Mode</li><li>While in Telekinesis Mode, get closer to the physics object and pick it up by pressing and holding Left Mouse Button</li><li>Move around to carry the physics object, release Left Mouse Button to release the physics object or press right mouse button to throw it away</li><li>To create your own pickable physics object, create a child of the blueprint BP_Physics_Pickup_Master and replace the static mesh with your own static mesh</li><li>Press T to toggle ON/Off Time Mode. While in Time mode, the time moves at normal speed when you move and the time slows down a lot when you don&#39;t move (slow down factor can be adjusted from the blueprint)</li><li>Hold Shift while walking to Run</li><li>Hold C to Crouch</li></ol>",
  "technicalDetails": "<p>Features: (Please include a full, comprehensive list of the features of the product)</p><ul><li> Advanced mechanics for Sliding, Telekinesis, Bullet Time (&#43; smooth crouching and running as a bonus)</li><li> Sliding, telekinesis and bullet time come with specific sound effects</li><li> Sliding is angle sensitive</li><li>While in telekinesis, the physics object can be simply released or thrown away (very useful for throwing objects into the enemies)</li><li>1 example map with necessary documentation to use all the mechanics</li><li>You can create as many physics objects you want and you can customize their physics properties and mesh</li></ul><p>Number of Blueprints: 5</p><p>Input: Please check the description</p><p>Network Replicated: No</p><p>Supported Development Platforms:</p><p>Windows: Yes</p><p>Mac: Not tested</p><p>Documentation: Check the description</p><p>Important/Additional Notes: It comes as a full project</p><p><br /></p><p>If you like this pack, feel free to write a review and rate it. This will keep me motivated to create better and better assets. Thank you!</p>",
  "keyImages": [
    {
      "type": "Screenshot",
      "url": "https://cdn1.epicgames.com/ue/product/Screenshot/1920per1080-1920x1080-d9e3140b2b8a3c0d9749378842d096ce.png",
      "md5": "d9e3140b2b8a3c0d9749378842d096ce",
      "width": 1920,
      "height": 1080,
      "size": 86315,
      "uploadedDate": "2022-06-17T13:50:25.324Z"
    },
    {
      "type": "Thumbnail",
      "url": "https://cdn1.epicgames.com/ue/product/Thumbnail/FPSMechanicsSlidingTelekinesisBulletTime_thumb-284x284-7e3550eb7018c2e5ae6a09274b328362.png",
      "md5": "7e3550eb7018c2e5ae6a09274b328362",
      "width": 284,
      "height": 284,
      "size": 23092,
      "uploadedDate": "2022-06-17T13:50:25.690Z"
    },
    {
      "type": "Featured",
      "url": "https://cdn1.epicgames.com/ue/product/Featured/FPSMechanicsSlidingTelekinesisBulletTime_featured-894x488-9070505e88a4dd36296bb5fa69a60c88.png",
      "md5": "9070505e88a4dd36296bb5fa69a60c88",
      "width": 894,
      "height": 488,
      "size": 54886,
      "uploadedDate": "2022-06-17T13:50:25.782Z"
    },
    {
      "type": "Snapshot",
      "url": "https://cdn1.epicgames.com/ue/product/Snapshot/1920per1080-1920x1080-d9e3140b2b8a3c0d9749378842d096ce_Snapshot.png",
      "md5": "93ef96248e3893b6366cd6c86103e448",
      "width": 150,
      "height": 74,
      "size": 3791,
      "uploadedDate": "2022-06-17T13:50:25.570Z"
    }
  ],
  "categories": [
    {
      "path": "projects"
    },
    {
      "path": "projects/completeprojects"
    }
  ],
  "namespace": "ue",
  "status": "ACTIVE",
  "creationDate": "2022-06-18T19:42:50.407Z",
  "lastModifiedDate": "2025-01-16T07:34:38.352Z",
  "customAttributes": {},
  "entitlementName": "034aac3818624a489c49692c16795532",
  "entitlementType": "EXECUTABLE",
  "itemType": "DURABLE",
  "releaseInfo": [
    {
      "id": "d4c40fc59f244318baf49209ed316d2d",
      "appId": "FPSMecha034aac381862V1",
      "compatibleApps": [
        "UE_5.0",
        "UE_5.1",
        "UE_5.2",
        "UE_5.3",
        "UE_5.4"
      ],
      "platform": [
        "Windows",
        "Xbox One",
        "Win32",
        "PS4",
        "Nintendo Switch"
      ],
      "dateAdded": "2022-06-17T00:00:00.000Z",
      "releaseNote": "",
      "versionTitle": "FPS Mechanics"
    }
  ],
  "developer": "Mathew81",
  "developerId": "o-ruuhxtdgy546w6eml65myrzxbe49tf",
  "endOfSupport": false,
  "unsearchable": false
}