{
  "id": "0a4c3940f5814dab909e8baf79b4c8a8",
  "title": "KHS - Korean Science Technology",
  "description": "We, the KOREA HERITAGE SERVICE [KHS] have digitized the Korean traditional science technology props.",
  "longDescription": "<p><a href=\"https://digital.khs.go.kr/\" rel=\"nofollow\">KOREA HERITAGE SERVICE [KHS]</a></p><p><br /></p><p>The rain gauge pedestal (National Treasure No. 331) was placed at Imunwon Hall of Changdeokgung Palace at the command of King Jeongjo in 1782 (the 6th year of the reign of King Jeongjo). The stand is made of marble, which was widely used in production of objects for the royal family, and is inscribed with letters exquisitely carved by a skilled craftsman. It was moved from the palace to the Gyeongseong (present-day Seoul) Museum around 1910, then to Myeongjeongjeon Hall at Changgyeonggung Palace, and again to the Gungjung Museum of Deoksugung Palace, before finally being transferred to its current location at the National Palace Museum of Korea.</p><p><br /></p><p>Small gun is one of the portable firearms made during the reign of King Seonjo (r. 1567-1608) of the Joseon Dynasty. Having a more advanced form than the seungja chongtong gun, it is longer than the latter with its bamboo-like joints evenly connected. The gun barrel is slightly bent to enable the bullets to receive a more powerful force during the shooting process and to reach long distances. The barrel of the gun has been made long so that the firearm does not leak and the bullets can hit the mark, and the powder chamber has been made slightly thick.</p><p><br /></p><p>Celestial Chart Stone is the carvings of a planisphere, a chart of constellations. It was made in 1396 by 11 astronomers including Gwon Geun and Yu Bang-taek under orders by King Taejo, the founder of the Joseon Dynasty, to symbolize the mandate of heaven for his new dynasty. Constellations are engraved on the upper portion with brief explanation. The lower portion is inscribed with the name, the background of the production process, names of participants and the date of production. With the North Pole in the center, the chart displays the Zodiac and the celestial equator. The constellations contain all of 1,464 stars visible to ordinary sight.</p><p><br /></p><p>Bomb Shell is invented by Yi Jang-son during the reign of King Seonjo (r. 1567-1608) in the mid-Joseon Period. The long-distance bomb shell was used for killing and injuring men and horses. The surface was made of cast iron, resembling a round gourd; the inside was made such that gunpowder and round metal, which were thin metal pieces, could be loaded. During gunfire, it fires using the gourd-shaped mortar. It consists of the wooden barrel whose diameter is 21 cm and whose circumference of 68 cm goes around a fuse, bamboo tube into which the wooden barrel goes (diameter: 5.2 cm), round metal, and iron lid (diameter: 7.6 cm × 8.4 cm).</p><p><br /></p><p>Reproduction Of Celestial Chart Stone is an astronomical chart carved on stone in the thirteenth year of King Sukjong’s reign. It was a repair of a previous one which had worn out since the original work done in the fourth year of the reign of King Taejo (1395). 1,464 stars are depicted within the round celestial body. The process of manufacture and the names of participants are also enumerated under the stars. With a slight change in structure, it is almost same as the original one. It also carries an explanatory article written by Gwon Geun. Exhibited in King Sejong the Great’s Monument at Hongneung in Seoul, its composition is grander and improved.</p><p><br /></p><p>Clepsydra of Changgyeonggung Palace is a water clock used for standard hours since the Three Kingdoms Period. Jagyeongnu, made in 1434 during the reign of King Sejong of Joseon, was the first water clock that was devised to strike the hour automatically with a bell, gong or drum. However, as it had not been properly preserved, King Jungjong had it remade in 1536, of which only some parts remain to the present. Two pedestals for the latter still remain behind the Myeongjeongjeon Hall of Changgyeonggung Palace.</p>",
  "technicalDetails": "<p>Number of Unique Meshes: 11</p><p>Collision: Yes</p><p>Vertex Count: 223 - 161,333</p><p>LODs: No</p><p>Number of Materials and Material Instances: 12</p><p>Number of Textures: 40</p><p>Texture Resolutions: 4096*4096</p><p>Supported Development Platforms:</p><p>Windows: Yes</p><p>Mac: No</p>",
  "keyImages": [
    {
      "type": "Screenshot",
      "url": "https://cdn1.epicgames.com/ue/product/Screenshot/screenshot-1920x1080-972eeb3e8d807d519f4b1a48dd9670be.jpg",
      "md5": "972eeb3e8d807d519f4b1a48dd9670be",
      "width": 1920,
      "height": 1080,
      "size": 501872,
      "uploadedDate": "2023-08-17T04:10:48.689Z"
    },
    {
      "type": "Thumbnail",
      "url": "https://cdn1.epicgames.com/ue/product/Thumbnail/NHAKoreanScienceTechnology_thumb-284x284-d02916ab0ff99a212f0abe837d8bb049.png",
      "md5": "d02916ab0ff99a212f0abe837d8bb049",
      "width": 284,
      "height": 284,
      "size": 105746,
      "uploadedDate": "2024-05-17T07:41:47.841Z"
    },
    {
      "type": "Featured",
      "url": "https://cdn1.epicgames.com/ue/product/Featured/NHAKoreanScienceTechnology_featured-894x488-1f8039aaa84a6deb75dfb14d12b847cf.png",
      "md5": "1f8039aaa84a6deb75dfb14d12b847cf",
      "width": 894,
      "height": 488,
      "size": 449570,
      "uploadedDate": "2023-08-17T04:10:49.285Z"
    },
    {
      "type": "Snapshot",
      "url": "https://cdn1.epicgames.com/ue/product/Snapshot/screenshot-1920x1080-972eeb3e8d807d519f4b1a48dd9670be_Snapshot.jpg",
      "md5": "9bcd79214d41f7a6dce3abea954c0209",
      "width": 150,
      "height": 74,
      "size": 4718,
      "uploadedDate": "2023-08-17T04:10:49.104Z"
    },
    {
      "type": "Snapshot",
      "url": "https://cdn1.epicgames.com/ue/product/Snapshot/Overview1080p13.06.202310-45-01-1920x1080-8bff82f187ecdaf3423822125c516f9b_Snapshot.png",
      "md5": "922f8d3b7ac750889f1bba71c2613ce9",
      "width": 150,
      "height": 74,
      "size": 3833,
      "uploadedDate": "2023-08-10T05:23:45.852Z"
    }
  ],
  "categories": [
    {
      "path": "assets/props"
    },
    {
      "path": "assets"
    }
  ],
  "namespace": "ue",
  "status": "SUNSET",
  "creationDate": "2023-12-26T07:39:10.105Z",
  "lastModifiedDate": "2024-12-19T05:38:25.402Z",
  "customAttributes": {},
  "entitlementName": "0a4c3940f5814dab909e8baf79b4c8a8",
  "entitlementType": "EXECUTABLE",
  "itemType": "DURABLE",
  "releaseInfo": [
    {
      "id": "dcb9216ef09c4499860ad2ede0d945f3",
      "appId": "NHAKorea0a4c3940f581V1",
      "compatibleApps": [
        "UE_5.1",
        "UE_5.2",
        "UE_5.3",
        "UE_5.4"
      ],
      "platform": [
        "Windows"
      ],
      "dateAdded": "2023-08-10T00:00:00.000Z",
      "releaseNote": "",
      "versionTitle": "Korean ScieneTech"
    }
  ],
  "developer": "KOREA HERITAGE SERVICE",
  "developerId": "o-ve5hh2jcncq4y6vzk8pr5m97ms3xxg",
  "endOfSupport": false,
  "requiresSecureAccount": false,
  "unsearchable": false
}