{
  "id": "7d3ac4518f684f65ac74864f3ab54888",
  "title": "February Community Interest Poll 2017",
  "description": "February Community Interest Poll",
  "longDescription": "With the close of another month, it is time for February's New Releases Interest Poll! \n\nBefore we announce the rules, there are a few changes that should be noted: \n\n1. You will need to provide an email address to finish the form. You should use the email address associated with your unreal engine account. \n2. First, second, and third, will receive a day to be featured each month. These will be on each Tuesday of the month. \n3. After the poll closes, we will be doing a drawing from those who participated in voting and will send a prize to the winner of this drawing. \n\nIf you need to see the items on the list or are intrigued by ones you haven't seen before, check out the Releases Update thread to find links to each pack. This poll will remain open from 03/01/2017 until 03/06/2017. \n\nTo vote, go to the link below: \n\n<a href=\"https://docs.google.com/a/epicgames.com/forms/d/e/1FAIpQLSeayboCHo3pzo58SvlZjOdgiVvIq6faW0ELS4_YRRcGr8kWCg/viewform\" target=\"_Blank\">https://docs.google.com/a/epicgames.com/forms/d/e/1FAIpQLSeayboCHo3pzo58SvlZjOdgiVvIq6faW0ELS4_YRRcGr8kWCg/viewform</a> \n\nWhen you vote, make sure to only choose one option for each of first, second, and third place. Currently, you are unable to deselect choices, but you can refresh the page if you accidentally choose multiples. The page will turn red if you do so as an indicator that this has occurred.",
  "technicalDetails": "Each selection is given a point value so it is important to note: \n\n1st place - 3 points\n2nd place - 2 points\n3rd place - 1 point\n\nAt the end we will tally up which selection has received the most votes. \n\nNow, there are a few general things we'd like you to keep in mind for this: \n\n1. Follow the Rules and Code of Conduct for the forums when posting on the forums. \n2. Respect fellow community members, content creators, and Epic staff. \n3. Do not disparage work, especially as a means to garner votes for another product. Having a negative view is perfectly acceptable, however do so in a civil and respectful manner. \n4. Communicating and promoting packs or assets is perfectly acceptable and also highly encouraged. Please do so without putting down or bashing other content in the process. \n5. Do not spam to promote an asset or pack.\n6. Promoting your own assets is fine, but do so respectfully and tastefully. Posting negative comments about a competitor's products, flaming, or otherwise harassing another content creator goes against the marketplace guidelines. \n7. Please limit yourself to 1 vote including a first, second, and third place option.",
  "keyImages": [
    {
      "type": "Featured",
      "url": "https://cdn1.epicgames.com/ue/item/unnamed-894x488-3322275b4e31429e554f0c90dc7004db.png",
      "md5": "3322275b4e31429e554f0c90dc7004db",
      "width": 894,
      "height": 488,
      "size": 29794,
      "uploadedDate": "2017-03-01T21:04:54.090Z"
    },
    {
      "type": "Screenshot",
      "url": "https://cdn1.epicgames.com/ue/item/unnamed (1)-1886x1061-7267141fad4526344b3ea591faee6552.png",
      "md5": "7267141fad4526344b3ea591faee6552",
      "width": 1886,
      "height": 1061,
      "size": 123946,
      "uploadedDate": "2017-03-01T21:05:03.356Z"
    }
  ],
  "categories": [
    {
      "path": "assets"
    }
  ],
  "namespace": "ue",
  "status": "ACTIVE",
  "creationDate": "2017-03-01T21:05:11.707Z",
  "lastModifiedDate": "2017-03-01T21:05:11.707Z",
  "customAttributes": {
    "BuyLink": {
      "type": "STRING",
      "value": "https://docs.google.com/a/epicgames.com/forms/d/e/1FAIpQLSeayboCHo3pzo58SvlZjOdgiVvIq6faW0ELS4_YRRcGr8kWCg/viewform"
    }
  },
  "entitlementName": "7d3ac4518f684f65ac74864f3ab54888",
  "entitlementType": "EXECUTABLE",
  "itemType": "DURABLE",
  "developer": "Epic Games",
  "developerId": "o-aa83a0a9bc45e98c80c1b1c9d92e9e",
  "eulaIds": [],
  "endOfSupport": false,
  "unsearchable": false
}