{
  "id": "a9311d60fe8041ca89e8bbccb062a56e",
  "title": "Estape Cryptography",
  "description": "Secure your Unreal Engine 5 projects with advanced AES encryption and data protection.",
  "longDescription": "<p><a href=\"https://estapetools.com/docs-estape-cryptography\" rel=\"nofollow\"><strong>Documentation</strong></a></p><p><br /></p><p><strong>More tools:</strong></p><p><a href=\"https://www.unrealengine.com/marketplace/en-US/product/estape-tools\" rel=\"nofollow\">Estape Tools - Blueprint Extension for Lightning-Fast Game and App Dev</a></p><p><a href=\"https://www.unrealengine.com/marketplace/en-US/product/outliner-organizer-01\" rel=\"nofollow\">Outline Organizer - Elevate your Unreal Engine 5 Level Design effortlessly!</a></p><p><br /></p><p><strong>More info:</strong></p><p><a href=\"https://estapetools.com/\" rel=\"nofollow\">estapetools.com</a></p><p>----------------------------------------------------</p><p><br /></p><p><strong>EstapeEncrypt</strong> is a cutting-edge encryption plugin for Unreal Engine 5, designed to provide robust and secure data protection for your projects. Whether you&#39;re developing games, simulations, or any other type of digital content, data security is paramount. EstapeEncrypt ensures that sensitive information within your project is safeguarded through advanced encryption techniques, making it an essential tool for developers who prioritize security.</p><p><br /></p><p><br /></p><p><br /></p><p><br /></p><p><br /></p><p><br /></p><h3>Key Features:</h3><ul><li><strong>AES Encryption</strong>: EstapeEncrypt leverages the Advanced Encryption Standard (AES), one of the most secure and widely used encryption algorithms in the industry. AES is known for its reliability and strength, ensuring that your data remains protected against unauthorized access.</li><li><strong>Easy Integration</strong>: The plugin is designed to seamlessly integrate with Unreal Engine 5, allowing developers to implement encryption functionalities without hassle. Whether you’re working on a small indie project or a large-scale production, EstapeEncrypt fits right into your workflow.</li><li><strong>Flexible Encryption Options</strong>: With EstapeEncrypt, you have the flexibility to choose the level of encryption that best suits your needs. From basic encryption for general data protection to advanced levels for highly sensitive information, this plugin covers all your security requirements.</li><li><strong>Cross-Platform Compatibility</strong>: EstapeEncrypt is built to be compatible across various platforms supported by Unreal Engine 5. Whether you’re developing for PC, console, mobile, or VR/AR, the plugin ensures consistent encryption performance across all platforms.</li><li><strong>OpenSSL Integration</strong>: EstapeEncrypt uses OpenSSL, a robust open-source library that provides the cryptographic algorithms required for encryption. OpenSSL is known for its reliability and is widely used in the industry. The plugin dynamically links to OpenSSL, ensuring compliance with licensing requirements and maintaining the flexibility of your project.</li><li><strong>Secure Key Management</strong>: The plugin includes features for secure key generation and management, allowing developers to generate cryptographic keys of varying strengths (1024, 2048, 3072, and 4096 bits). This ensures that your encryption keys are as strong as your data protection needs.</li><li><strong>Support for Large Data Encryption</strong>: EstapeEncrypt is capable of handling encryption and decryption of large datasets, making it ideal for projects that involve substantial amounts of sensitive information, such as user data, game states, and proprietary assets.</li><li><strong>No Data Collection</strong>: EstapeEncrypt respects user privacy and does not collect or send any data back to the creator. It is purely focused on providing encryption functionalities without any telemetry or data mining.</li></ul><h3>Use Cases:</h3><ul><li><strong>Game Development</strong>: Protect player data, game states, and in-game transactions with strong encryption. Ensure that your multiplayer or online game is secure against data breaches and unauthorized access.</li><li><strong>Enterprise Applications</strong>: Secure sensitive business data in applications developed with Unreal Engine 5. Whether it’s financial data, customer information, or internal communications, EstapeEncrypt ensures that your enterprise-level applications are protected.</li><li><strong>Virtual Reality (VR) and Augmented Reality (AR)</strong>: As VR and AR projects often involve sensitive user data and proprietary content, EstapeEncrypt provides the necessary tools to secure this information, ensuring a safe and protected experience.</li><li><strong>Digital Simulations</strong>: For developers working on simulations that involve confidential data, such as military or medical simulations, EstapeEncrypt provides the peace of mind that this data is secure and inaccessible to unauthorized parties.</li></ul><h3>Why Choose EstapeEncrypt?</h3><ul><li><strong>Reliability</strong>: Built on proven encryption standards, EstapeEncrypt is a reliable choice for securing your Unreal Engine 5 projects. With AES at its core, you can trust that your data is well-protected.</li><li><strong>Performance</strong>: Despite its robust security features, EstapeEncrypt is optimized for performance, ensuring that your encryption processes do not hinder the overall performance of your project.</li><li><strong>Ease of Use</strong>: With a user-friendly interface and seamless integration, EstapeEncrypt makes it easy for developers of all skill levels to implement strong encryption in their projects.</li><li><strong>Ongoing Support and Updates</strong>: As security standards evolve, so does EstapeEncrypt. Regular updates ensure that your projects remain secure with the latest encryption techniques and industry best practices.</li><li><strong>Compliant with Unreal Engine Marketplace Standards</strong>: EstapeEncrypt adheres to all Unreal Engine Marketplace guidelines, ensuring that your use of third-party software is compliant and transparent.</li></ul><h3>Licensing Information:</h3><p>EstapeEncrypt uses OpenSSL, which is licensed under the Apache License 2.0. This permissive license allows for commercial use, ensuring that you can confidently distribute your projects that utilize EstapeEncrypt. The plugin dynamically links to OpenSSL, and there is no data collection or telemetry involved.</p><p><br /></p><p><br /></p><p><br /></p><p><br /></p><p><br /></p><p><br /></p><h3>Technical Details</h3><p><strong>TECHNICAL INFORMATION</strong></p><p><strong>Code Modules:</strong></p><ul><li>EstapeEncryptationBPLibrary [Runtime]</li></ul><p><strong>Supported Development Platforms:</strong></p><ul><li>Windows</li><li>Linux</li></ul><p><strong>Supported Target Build Platforms:</strong></p><ul><li>Windows</li><li>Linux</li></ul>",
  "technicalDetails": "<h3>Features:</h3><ul><li><strong>Advanced AES Encryption</strong>: Implements AES for secure data encryption with various key sizes.</li><li><strong>Seamless Integration</strong>: Easily integrates into any Unreal Engine 5 project, compatible with both Blueprint and C&#43;&#43;.</li><li><strong>Cross-Platform Compatibility</strong>: Works on Windows and Linux, ensuring consistent encryption performance.</li><li><strong>Flexible Encryption Options</strong>: Supports encryption and decryption for single bytes and large data arrays.</li><li><strong>Secure Key Management</strong>: Generate and manage cryptographic keys, with support for 1024, 2048, 3072, and 4096-bit keys.</li><li><strong>Dynamic OpenSSL Integration</strong>: Uses OpenSSL, dynamically linked for performance and flexibility.</li><li><strong>Optimized Performance</strong>: Efficiently handles large datasets with minimal impact on project performance.</li><li><strong>No Data Collection</strong>: Does not collect or transmit any user data.</li><li><strong>Comprehensive Documentation</strong>: Includes detailed documentation for easy implementation.</li></ul><h3>Technical Details</h3><p><strong>TECHNICAL INFORMATION</strong></p><p><strong>Code Modules:</strong></p><ul><li>EstapeEncryptationBPLibrary [Runtime]</li></ul><p><strong>Supported Development Platforms:</strong></p><ul><li>Windows</li><li>Linux</li></ul><p><strong>Supported Target Build Platforms:</strong></p><ul><li>Windows</li><li>Linux</li></ul>",
  "keyImages": [
    {
      "type": "Screenshot",
      "url": "https://cdn1.epicgames.com/ue/product/Screenshot/Gallery1920x1080-1920x1080-9e9da66b4a004f1fc6203e5fc2bf1fff.png",
      "md5": "9e9da66b4a004f1fc6203e5fc2bf1fff",
      "width": 1920,
      "height": 1080,
      "size": 123356,
      "uploadedDate": "2024-08-10T21:56:02.343Z"
    },
    {
      "type": "Thumbnail",
      "url": "https://cdn1.epicgames.com/ue/product/Thumbnail/EstapeCryptography_thumb-284x284-bc6d433fc7b01fe86ce4ff8c5bedc4b4.png",
      "md5": "bc6d433fc7b01fe86ce4ff8c5bedc4b4",
      "width": 284,
      "height": 284,
      "size": 15800,
      "uploadedDate": "2024-08-10T21:56:02.705Z"
    },
    {
      "type": "Featured",
      "url": "https://cdn1.epicgames.com/ue/product/Featured/EstapeCryptography_featured-894x488-4fea29f8ee927d7617dcd9aafa061909.png",
      "md5": "4fea29f8ee927d7617dcd9aafa061909",
      "width": 894,
      "height": 488,
      "size": 104843,
      "uploadedDate": "2024-08-10T21:56:02.785Z"
    },
    {
      "type": "Snapshot",
      "url": "https://cdn1.epicgames.com/ue/product/Snapshot/Gallery1920x1080-1920x1080-9e9da66b4a004f1fc6203e5fc2bf1fff_Snapshot.png",
      "md5": "9abae6c8be0076f3eb89ba002507be8b",
      "width": 150,
      "height": 74,
      "size": 3340,
      "uploadedDate": "2024-08-10T21:56:02.631Z"
    }
  ],
  "categories": [
    {
      "path": "plugins/engine"
    },
    {
      "path": "plugins"
    }
  ],
  "namespace": "ue",
  "status": "ACTIVE",
  "creationDate": "2024-08-20T13:23:45.618Z",
  "lastModifiedDate": "2024-10-30T18:05:25.728Z",
  "customAttributes": {},
  "entitlementName": "a9311d60fe8041ca89e8bbccb062a56e",
  "entitlementType": "EXECUTABLE",
  "itemType": "DURABLE",
  "releaseInfo": [
    {
      "id": "942f7c93b611408da9331057aa255433",
      "appId": "EstapeEncrypt_5.3",
      "compatibleApps": [
        "UE_5.3"
      ],
      "platform": [
        "Windows",
        "Linux"
      ],
      "dateAdded": "2024-08-22T00:00:00.000Z",
      "releaseNote": "First upload for 5.3",
      "versionTitle": "UE5.3_v1.0.0"
    },
    {
      "id": "ca2ea988247349dab493bfcb89b419c8",
      "appId": "EstapeEncrypt_5.4",
      "compatibleApps": [
        "UE_5.4"
      ],
      "platform": [
        "Windows",
        "Linux"
      ],
      "dateAdded": "2024-08-10T00:00:00.000Z",
      "releaseNote": "First upload!",
      "versionTitle": "UE5.4_v1.0.0"
    }
  ],
  "developer": "Rodrigo Estape",
  "developerId": "o-cdd235693a47acbe1a7907063f0ae4",
  "endOfSupport": false,
  "requiresSecureAccount": false,
  "unsearchable": false
}