{
  "id": "c20409cb3e634eb7a66e4328b8b5da05",
  "title": "Amazon GameLift Unreal Plugin",
  "description": "Amazon GameLift is a managed service for deploying and scaling dedicated multiplayer game servers in the AWS Cloud.",
  "longDescription": "Amazon GameLift is a managed service for deploying, operating, and scaling dedicated multiplayer game servers in the AWS Cloud. Amazon GameLift makes it easy to manage server infrastructure, scale capacity to lower latency and cost, match players into game sessions, and defend from DDoS attacks. You pay for the compute, storage, and bandwidth your games actually use, without monthly or annual contracts.\n\nServer Management:\nAmazon GameLift provisions instances, deploys your game servers onto running instances, and load balances traffic across fleets of game servers.\n\nAutoscaling:\nGame servers are typically idle 50% of the time. Automatically scale capacity up and down to ensure you use and pay for only what you need.\n\nMatchmaking:\nAmazon GameLift’s matchmaking functionality intelligently selects the closest available game server based on each player’s location, giving players the lowest possible latency by leveraging AWS’s broad global footprint.\n\nDDoS Protection:\nDesigned to safeguard your game servers from frequently occurring network and transport layer DDoS attacks.\n\nGlobal Reach:\nDeploy your game servers in 9 AWS Regions across 4 continents to reach your players with low-latency connections.\n\nHigh-Performance Instances:\nChoose from 5 instance types optimized for different use cases. You have the flexibility to select a configuration that is optimal for your game.\n\nPay as you go:\nRun your dedicated game servers without monthly commitments. Only pay for the resources you use, on an hourly basis.",
  "technicalDetails": "You can use Amazon GameLift to create new Game Sessions, add players to Game Sessions, and manage the lifecycles of Game Sessions.\n\n\n\n1. Launch Game Server \n\nWhen Amazon GameLift starts a new instance, it also starts one or more Game Servers. Each Game Server initializes using your custom command line parameters. Once a Game Server is active, Amazon GameLift regularly monitors its health.\n\n\n\n2. Start Game Session\n\nTo start a new Game Session, your Game Client or Auxiliary Game Service asks Amazon GameLift to create a new Game Session. Amazon GameLift locates an available Game Server and associates it with a new Game Session. During this process, you have the opportunity to pass configuration information such as the game map or multiplayer mode to use.\n\n\n\n3. Add Player Session\n\nTo add a new player to a Game Session, your Game Client or Auxiliary Game Service asks Amazon GameLift to create a new Player Session and add that Player Session to the Game Session. Amazon GameLift returns an IP address and port number for the Game Server associated with the Game Session. From this point forward, the Game Client directly communicates with the Game Server without going through Amazon GameLift. When the Game Client contacts your Game Server to attempt to join the Game Session, your Game Server validates with Amazon GameLift that the player is authorized for the Game Session.\n\n\n\n4. Stop Game Session\n\nWhen the Game Session is over, your Game Server tells Amazon GameLift to terminate the Game Session.\n\n\n\n5. Shut Down Server Process\n\nFinally, your Game Server notifies Amazon GameLift that the Game Server is shutting down.\n\n\n\nGet started in minutes by downloading the Amazon GameLIft Server SDK. The Amazon GameLift Unreal Plugin is contained within the Amazon GameLift Server SDK download.\n\n\n\nPlatforms: Windows Server 2012 and Amazon Linux.\n\n\n\nQuestions? Comments? Visit the Amazon GameLift Forums: http://amzn.to/gamelift-forums",
  "keyImages": [
    {
      "type": "Featured",
      "url": "https://cdn1.epicgames.com/ue/item/spartacus_featured-437x246-f47c8b0aff4c6c150ceb97abe097bcf5.png",
      "md5": "f47c8b0aff4c6c150ceb97abe097bcf5",
      "width": 437,
      "height": 246,
      "size": 47137,
      "uploadedDate": "2017-02-20T19:59:09.103Z"
    },
    {
      "type": "Thumbnail",
      "url": "https://cdn1.epicgames.com/ue/item/alona_Thumb-284x284-afba27d1ca9baa741ebebf8a5bf591cf.png",
      "md5": "afba27d1ca9baa741ebebf8a5bf591cf",
      "width": 284,
      "height": 284,
      "size": 31109,
      "uploadedDate": "2017-02-20T19:59:13.624Z"
    },
    {
      "type": "Screenshot",
      "url": "https://cdn1.epicgames.com/ue/item/store_streamline_screenshot_2-1920x1080-9d6429cd35dd9ce7c5a784d9fddf1ab6.png",
      "md5": "9d6429cd35dd9ce7c5a784d9fddf1ab6",
      "width": 1920,
      "height": 1080,
      "size": 587193,
      "uploadedDate": "2017-02-20T19:59:26.497Z"
    },
    {
      "type": "Screenshot",
      "url": "https://cdn1.epicgames.com/ue/item/store_streamline_screenshot_3-1920x1080-802bc82f923750cf9f68d3584cb264e5.png",
      "md5": "802bc82f923750cf9f68d3584cb264e5",
      "width": 1920,
      "height": 1080,
      "size": 557603,
      "uploadedDate": "2017-02-20T19:59:31.884Z"
    },
    {
      "type": "NewFeatured",
      "url": "https://cdn1.epicgames.com/ue/item/rawlins_FeaturedNew-868x488-f1b6adf2591c0fb1760e53d64ed877f1.png",
      "md5": "f1b6adf2591c0fb1760e53d64ed877f1",
      "width": 868,
      "height": 488,
      "size": 152354,
      "uploadedDate": "2017-02-20T19:59:52.099Z"
    }
  ],
  "categories": [
    {
      "path": "plugins/engine"
    },
    {
      "path": "plugins"
    }
  ],
  "namespace": "ue",
  "status": "SUNSET",
  "creationDate": "2017-02-20T19:59:59.498Z",
  "lastModifiedDate": "2021-10-20T17:04:35.043Z",
  "customAttributes": {},
  "entitlementName": "c20409cb3e634eb7a66e4328b8b5da05",
  "entitlementType": "EXECUTABLE",
  "itemType": "DURABLE",
  "releaseInfo": [],
  "developer": "Amazon",
  "developerId": "o-z2qmx27qhskzsm5jg4lrn7lrhbz9dj",
  "eulaIds": [],
  "installModes": [],
  "endOfSupport": false,
  "ageGatings": {},
  "applicationId": "",
  "unsearchable": false
}